/* ----------------------------------------------------------------<Header>-
 Name: Main.cpp
 Group: TI-81
 Students: Slavskyy S.V., Dubrov B.Y.
 Written: 
 Revised: 
 Description:. 
    
 ------------------------------------------------------------------</Header>-*/
#include <iostream>
#include <cstring>
using namespace std;
class stack{
	char *stck;
	int tos;
	int size;
public:
	stack();
	~stack();
	char pop();
};
stack::stack(){
	stck=(char *)malloc(1);
	if(!stck){
		cout<<"error";
		exit(1);
	}
	strcpy(stck,"x");
	tos=1;
}
stack::~stack(){
	free(stck);
}
// void stack::push(char ch){
// 	if(tos==size){
// 		cout<<"stack is full";
// 		return;
// 	}
// 	stck[tos]=ch;
// 	tos++;
// }
char stack::pop(){
	if(tos==0){
		cout<<"Stack is empty";
		return 0;
	}
	tos--;
	return stck[tos];
}
int main() {
 	cout<<
 	"|-------------------------------------------------------------------|\n"<<
 	"|Опервция|                        Назначение                        |\n"<<
 	"|-------------------------------------------------------------------|\n"<<
 	"|  DUP   |        Копировать верхний объект стека(A->AA)            |\n"<<
 	"|-------------------------------------------------------------------|\n"<<
 	"|  MUL   |      Перемножить два врхних елемента стека(5 2->10)      |\n"<<
 	"|-------------------------------------------------------------------|\n"<<
 	"|  SWAP  |   Поменять местами два верхних элемента стека (AB->BA)   |\n"<<
 	"|-------------------------------------------------------------------|\n"<<
 	"|  ADD   |        Сложить два верхних элемента стека (5 2->7)       |\n"<<
 	"|-------------------------------------------------------------------|\n"<<
 	"|  OVER  |Cкопироват второй сверху объект стека на вершину (AB->BAB)|\n"<<
 	"|-------------------------------------------------------------------|\n"<<
 	"|  SIN   |   Заменить верхний обЪект строки на его синус (3.14->0)  |\n"<<
 	"|-------------------------------------------------------------------|\n"<<
 	"|  COS   |  Заменить верхний обЪект строки на его косинус (-3.14->0)|\n"<<
 	"|-------------------------------------------------------------------|\n";
 		  return 0;
}
/* ---------------------------------------------------------------------[<]-
Test1 output:
---------------------------------------------------------------------[>]-*/